package LMG;

public class Solution3 {
    // Петя решил прогуляться по ближайшим кафе и узнать, в каком из них готовят самую вкусную шаверму. Петя знает стоимость шавермы в каждом из них. При этом он хочет попробовать ровно N шаверм, на которые у него есть M рублей.
    //Определите, какую максимальную сумму потратит Петя. Функция должна возвращать максимально возможную сумму за N шаверм меньшую или равную бюджету.
    //Если на M рублей невозможно купить N шаверм, то функция должна вернуть 0.
    //
    //На входе:
    //1. prices - массив чисел (int) - стоимость шавермы в разных заведениях
    //2. N - число (int) - количество шаверм, которые собирается съесть Петя
    //3. M - число (int) - максимальная сумма, которую Петя может потратить
    //
    //На выходе: число (int) - максимальная сумма, удовлетворяющая условиям
    //
    //Пример:
    //
    //# стоимость шаверм в кафе
    //prices = [350, 250, 100, 1600, 500, 150, 150]
    //# количество шаверм, которые собирается съесть Петя
    //N = 2
    //# доступный бюджет
    //M = 1672
    //# максимальная сумма за 2 шавермы в рамках доступного бюджета
    //take_my_money(prices, N, M) --> 850
}
